FSEmbedded/freertos-fus-pre/boards/fsimx8mp/cmsis_driver_examples/i2c/int_b2b_transfer/master/pin_mux.h
/*
 * Copyright 2019-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "board.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                                 /*!< Function assigned for the core: Cortex-M7F[m7] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */

#ifdef BOARD_PICOCOREMX8MP
void I2C6_DeinitPins(void);                                /*!< Function assigned for the core: Cortex-M7F[m7] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */

void I2C6_InitPins(void);                                  /*!< Function assigned for the core: Cortex-M7F[m7] */
#endif /* BOARD_PICOCOREMX8MP */
#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
